; domain
(define (domain Floods)
	(:requirements :typing)
(:types
	usv ugv uav - robot
	robot area disaster store cdm box - object
)
(:predicates
	(communicated_data ?d - disaster)
	(visible_from ?d - disaster ?a - area)
	(have_water_sample_cdm ?c - cdm ?a - area)
	(box_at_area ?b - box ?a - area)
	(have_picture ?r - robot ?d - disaster)
	(empty ?s - store)
	(store_of ?s - store ?r - robot)
	(in_range ?a1 - area ?a2 - area)
	(box_at_cdm ?b - box ?c - cdm)
	(ground_path ?a1 - area ?a2 - area)
	(cdm_at ?c - cdm ?a - area)
	(box_at ?b - box ?r - ugv)
	(at ?r - robot ?a - area)
	(have_water_sample ?r - usv ?a - area)
	(water_path ?a1 - area ?a2 - area)
	(full ?s - store)
)

(:action navigate_usv
	:parameters (?r - usv ?a1 - area ?a2 - area)
	:precondition (and
		(at ?r ?a1)
		(water_path ?a1 ?a2)
	)
	:effect (and
		(not (at ?r ?a1))
		(at ?r ?a2)
	)
)


(:action navigate_ugv
	:parameters (?r - ugv ?a1 - area ?a2 - area)
	:precondition (and
		(at ?r ?a1)
		(ground_path ?a1 ?a2)
	)
	:effect (and
		(not (at ?r ?a1))
		(at ?r ?a2)
	)
)


(:action navigate_uav
	:parameters (?r - uav ?a1 - area ?a2 - area)
	:precondition 
		(at ?r ?a1)
	:effect (and
		(not (at ?r ?a1))
		(at ?r ?a2)
	)
)


(:action take_picture
	:parameters (?r - robot ?a - area ?d - disaster)
	:precondition (and
		(visible_from ?d ?a)
		(at ?r ?a)
	)
	:effect 
		(have_picture ?r ?d)
)


(:action sample_water
	:parameters (?r - usv ?s - store ?a - area)
	:precondition (and
		(at ?r ?a)
		(store_of ?s ?r)
		(empty ?s)
	)
	:effect (and
		(not (empty ?s))
		(full ?s)
		(have_water_sample ?r ?a)
	)
)


(:action drop_sample
	:parameters (?r - usv ?s - store ?a1 - area ?a2 - area ?c - cdm)
	:precondition (and
		(store_of ?s ?r)
		(have_water_sample ?r ?a2)
		(cdm_at ?c ?a1)
		(at ?r ?a1)
	)
	:effect (and
		(not (full ?s))
		(not (have_water_sample ?r ?a2))
		(empty ?s)
		(have_water_sample_cdm ?c ?a2)
	)
)


(:action pickup_box
	:parameters (?r - ugv ?s - store ?c - cdm ?a - area ?b - box)
	:precondition (and
		(box_at_cdm ?b ?c)
		(cdm_at ?c ?a)
		(at ?r ?a)
		(store_of ?s ?r)
		(empty ?s)
	)
	:effect (and
		(not (empty ?s))
		(not (box_at_cdm ?b ?c))
		(full ?s)
		(box_at ?b ?r)
	)
)


(:action drop_box
	:parameters (?r - ugv ?s - store ?a - area ?b - box)
	:precondition (and
		(box_at ?b ?r)
		(store_of ?s ?r)
		(at ?r ?a)
	)
	:effect (and
		(not (full ?s))
		(not (box_at ?b ?r))
		(empty ?s)
		(box_at_area ?b ?a)
	)
)


(:action communicate_data
	:parameters (?r - robot ?c - cdm ?d - disaster ?a1 - area ?a2 - area)
	:precondition (and
		(at ?r ?a1)
		(cdm_at ?c ?a2)
		(have_picture ?r ?d)
		(in_range ?a1 ?a2)
	)
	:effect (and
		(not (have_picture ?r ?d))
		(communicated_data ?d)
	)
)

)

; problem
(define (problem floodsp10) (:domain Floods)
(:objects
	ugv1Store - store
	ugv2Store - store
	ugv3Store - store
	ugv4Store - store
	ugv5Store - store
	ugv6Store - store
	ugv7Store - store
	ugv8Store - store
	ugv9Store - store
	ugv10Store - store
	ugv11Store - store
	ugv12Store - store
	usv1Store - store
	usv2Store - store
	usv3Store - store
	usv4Store - store
	usv5Store - store
	usv6Store - store
	usv7Store - store
	usv8Store - store
	usv9Store - store
	usv10Store - store
	usv11Store - store
	usv12Store - store
	cdm1 - cdm
	cdm2 - cdm
	cdm3 - cdm
	cdm4 - cdm
	cdm5 - cdm
	cdm6 - cdm
	ugv1 - usv
	area1 - area
	area2 - area
	area3 - area
	area4 - area
	area5 - area
	area6 - area
	area7 - area
	area8 - area
	area9 - area
	area10 - area
	area11 - area
	area12 - area
	area13 - area
	area14 - area
	area15 - area
	area16 - area
	area17 - area
	area18 - area
	area19 - area
	area20 - area
	area21 - area
	area22 - area
	area23 - area
	area24 - area
	area25 - area
	area26 - area
	area27 - area
	area28 - area
	area29 - area
	area30 - area
	area31 - area
	area32 - area
	area33 - area
	area34 - area
	area35 - area
	area36 - area
	area37 - area
	area38 - area
	area39 - area
	area40 - area
	area41 - area
	area42 - area
	area43 - area
	area44 - area
	area45 - area
	area46 - area
	area47 - area
	area48 - area
	area49 - area
	area50 - area
	area51 - area
	area52 - area
	area53 - area
	area54 - area
	area55 - area
	area56 - area
	area57 - area
	area58 - area
	area59 - area
	area60 - area
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	ugv1 - ugv
	ugv1 - uav
	disaster1 - disaster
	disaster2 - disaster
	disaster3 - disaster
	disaster4 - disaster
	disaster5 - disaster
	disaster6 - disaster
	disaster7 - disaster
	disaster8 - disaster
	disaster9 - disaster
	disaster10 - disaster
	disaster11 - disaster
	disaster12 - disaster
	disaster13 - disaster
	disaster14 - disaster
	disaster15 - disaster
	disaster16 - disaster
)
(:init
	(water_path area27 area28)
	(water_path area29 area33)
	(cdm_at cdm3 area21)
	(ground_path area4 area6)
	(visible_from disaster2 area27)
	(water_path area35 area38)
	(store_of usv11Store ugv1)
	(water_path area24 area29)
	(store_of usv6Store ugv1)
	(ground_path area21 area36)
	(water_path area60 area58)
	(water_path area38 area17)
	(ground_path area15 area3)
	(empty ugv3Store)
	(water_path area22 area26)
	(ground_path area1 area16)
	(ground_path area47 area50)
	(ground_path area18 area37)
	(ground_path area8 area7)
	(water_path area38 area35)
	(water_path area58 area56)
	(visible_from disaster5 area13)
	(cdm_at cdm6 area53)
	(empty ugv2Store)
	(water_path area15 area18)
	(water_path area32 area26)
	(water_path area34 area36)
	(ground_path area23 area25)
	(water_path area2 area1)
	(ground_path area1 area3)
	(ground_path area44 area43)
	(ground_path area59 area60)
	(box_at_cdm box1 cdm1)
	(ground_path area55 area43)
	(box_at_cdm box9 cdm6)
	(empty ugv8Store)
	(empty usv3Store)
	(water_path area22 area34)
	(ground_path area34 area37)
	(water_path area56 area41)
	(water_path area36 area34)
	(empty usv12Store)
	(water_path area48 area47)
	(water_path area53 area33)
	(ground_path area7 area8)
	(ground_path area19 area20)
	(water_path area24 area25)
	(water_path area7 area8)
	(ground_path area31 area25)
	(ground_path area51 area45)
	(in_range area29 area33)
	(store_of usv12Store ugv1)
	(store_of ugv6Store ugv1)
	(water_path area26 area22)
	(ground_path area56 area57)
	(in_range area22 area21)
	(ground_path area10 area7)
	(store_of usv2Store ugv1)
	(in_range area49 area53)
	(in_range area10 area13)
	(water_path area32 area30)
	(water_path area46 area42)
	(visible_from disaster16 area28)
	(visible_from disaster10 area37)
	(in_range area53 area53)
	(ground_path area41 area43)
	(box_at_cdm box7 cdm5)
	(ground_path area18 area20)
	(water_path area34 area22)
	(ground_path area31 area29)
	(water_path area28 area29)
	(ground_path area53 area33)
	(store_of usv9Store ugv1)
	(ground_path area35 area36)
	(water_path area2 area14)
	(water_path area39 area40)
	(ground_path area38 area40)
	(water_path area29 area24)
	(ground_path area36 area37)
	(ground_path area55 area58)
	(water_path area30 area32)
	(ground_path area33 area53)
	(empty usv2Store)
	(water_path area21 area36)
	(water_path area47 area48)
	(water_path area19 area20)
	(empty ugv10Store)
	(water_path area49 area53)
	(empty usv8Store)
	(empty usv6Store)
	(ground_path area35 area38)
	(ground_path area49 area51)
	(in_range area23 area21)
	(water_path area4 area5)
	(water_path area52 area46)
	(water_path area53 area13)
	(water_path area9 area4)
	(water_path area24 area22)
	(ground_path area10 area4)
	(ground_path area28 area7)
	(water_path area57 area59)
	(water_path area26 area32)
	(ground_path area16 area1)
	(ground_path area9 area11)
	(ground_path area50 area47)
	(ground_path area21 area23)
	(cdm_at cdm5 area41)
	(water_path area58 area55)
	(water_path area18 area16)
	(in_range area3 area1)
	(in_range area50 area53)
	(ground_path area25 area31)
	(water_path area8 area27)
	(ground_path area13 area53)
	(water_path area20 area19)
	(visible_from disaster8 area11)
	(at ugv1 area21)
	(water_path area45 area44)
	(visible_from disaster15 area20)
	(ground_path area46 area44)
	(ground_path area33 area30)
	(ground_path area11 area5)
	(box_at_cdm box5 cdm3)
	(in_range area42 area41)
	(store_of usv7Store ugv1)
	(visible_from disaster7 area55)
	(at ugv1 area1)
	(water_path area33 area29)
	(ground_path area38 area35)
	(water_path area1 area16)
	(water_path area12 area10)
	(water_path area29 area28)
	(cdm_at cdm2 area13)
	(water_path area37 area39)
	(ground_path area43 area45)
	(ground_path area23 area24)
	(ground_path area7 area28)
	(water_path area48 area49)
	(water_path area4 area2)
	(ground_path area60 area59)
	(ground_path area18 area15)
	(visible_from disaster4 area36)
	(water_path area25 area24)
	(water_path area2 area4)
	(water_path area53 area49)
	(ground_path area6 area4)
	(empty usv11Store)
	(ground_path area37 area18)
	(water_path area60 area59)
	(empty usv4Store)
	(store_of ugv2Store ugv1)
	(water_path area41 area42)
	(water_path area56 area54)
	(water_path area13 area53)
	(water_path area44 area49)
	(ground_path area23 area21)
	(store_of ugv9Store ugv1)
	(empty ugv4Store)
	(ground_path area24 area26)
	(ground_path area47 area48)
	(water_path area42 area54)
	(ground_path area27 area28)
	(ground_path area10 area13)
	(empty ugv6Store)
	(box_at_cdm box8 cdm5)
	(store_of ugv5Store ugv1)
	(ground_path area3 area1)
	(store_of usv5Store ugv1)
	(ground_path area3 area5)
	(box_at_cdm box2 cdm2)
	(empty usv10Store)
	(ground_path area60 area58)
	(ground_path area56 area41)
	(empty ugv11Store)
	(ground_path area37 area34)
	(water_path area42 area46)
	(water_path area44 area42)
	(water_path area44 area45)
	(empty ugv1Store)
	(at ugv1 area53)
	(ground_path area35 area23)
	(water_path area12 area6)
	(visible_from disaster11 area24)
	(ground_path area17 area14)
	(empty usv5Store)
	(ground_path area27 area30)
	(cdm_at cdm4 area33)
	(ground_path area45 area51)
	(at ugv1 area13)
	(ground_path area55 area56)
	(ground_path area58 area60)
	(visible_from disaster12 area30)
	(water_path area41 area56)
	(water_path area54 area42)
	(water_path area6 area2)
	(ground_path area56 area55)
	(ground_path area30 area33)
	(in_range area2 area1)
	(ground_path area53 area50)
	(ground_path area45 area43)
	(ground_path area41 area56)
	(ground_path area36 area21)
	(water_path area49 area48)
	(in_range area13 area13)
	(ground_path area15 area16)
	(ground_path area50 area53)
	(box_at_cdm box3 cdm1)
	(ground_path area3 area15)
	(ground_path area50 area44)
	(empty ugv12Store)
	(water_path area59 area57)
	(ground_path area54 area57)
	(water_path area17 area19)
	(ground_path area30 area27)
	(water_path area55 area58)
	(ground_path area43 area55)
	(box_at_cdm box6 cdm4)
	(water_path area14 area16)
	(in_range area1 area1)
	(water_path area46 area52)
	(water_path area18 area15)
	(ground_path area3 area4)
	(in_range area30 area33)
	(water_path area40 area39)
	(ground_path area26 area24)
	(store_of ugv10Store ugv1)
	(water_path area9 area13)
	(box_at_cdm box4 cdm4)
	(water_path area16 area1)
	(water_path area33 area53)
	(ground_path area15 area18)
	(water_path area16 area18)
	(empty usv1Store)
	(in_range area33 area33)
	(ground_path area30 area24)
	(ground_path area17 area16)
	(ground_path area5 area11)
	(ground_path area29 area31)
	(water_path area36 area38)
	(empty usv7Store)
	(water_path area54 area56)
	(at ugv1 area33)
	(water_path area6 area12)
	(ground_path area40 area38)
	(ground_path area24 area23)
	(visible_from disaster6 area7)
	(in_range area41 area41)
	(water_path area58 area60)
	(water_path area16 area14)
	(ground_path area53 area13)
	(visible_from disaster3 area49)
	(water_path area8 area7)
	(water_path area22 area24)
	(ground_path area57 area56)
	(store_of usv4Store ugv1)
	(ground_path area36 area35)
	(water_path area40 area38)
	(water_path area21 area22)
	(ground_path area23 area35)
	(ground_path area40 area39)
	(water_path area8 area9)
	(empty usv9Store)
	(water_path area38 area36)
	(store_of ugv7Store ugv1)
	(water_path area14 area2)
	(store_of usv8Store ugv1)
	(water_path area9 area8)
	(water_path area13 area9)
	(water_path area50 area52)
	(water_path area56 area58)
	(water_path area28 area27)
	(water_path area19 area17)
	(ground_path area28 area27)
	(ground_path area44 area46)
	(ground_path area57 area54)
	(in_range area9 area13)
	(water_path area49 area44)
	(store_of usv10Store ugv1)
	(ground_path area13 area10)
	(cdm_at cdm1 area1)
	(visible_from disaster14 area38)
	(ground_path area39 area40)
	(water_path area39 area37)
	(water_path area42 area44)
	(ground_path area4 area10)
	(ground_path area51 area49)
	(store_of usv3Store ugv1)
	(water_path area5 area4)
	(empty ugv7Store)
	(in_range area43 area41)
	(ground_path area20 area19)
	(box_at_cdm box10 cdm6)
	(store_of ugv3Store ugv1)
	(water_path area22 area21)
	(ground_path area16 area15)
	(visible_from disaster1 area58)
	(water_path area38 area40)
	(water_path area4 area9)
	(water_path area10 area12)
	(ground_path area7 area10)
	(water_path area18 area20)
	(water_path area1 area2)
	(at ugv1 area41)
	(in_range area21 area21)
	(visible_from disaster13 area44)
	(water_path area20 area18)
	(water_path area36 area21)
	(water_path area52 area50)
	(ground_path area5 area3)
	(store_of ugv12Store ugv1)
	(ground_path area37 area36)
	(ground_path area44 area50)
	(store_of ugv4Store ugv1)
	(empty ugv9Store)
	(visible_from disaster9 area41)
	(ground_path area25 area23)
	(empty ugv5Store)
	(store_of ugv1Store ugv1)
	(water_path area27 area8)
	(ground_path area4 area3)
	(store_of usv1Store ugv1)
	(ground_path area14 area17)
	(water_path area59 area60)
	(water_path area2 area6)
	(store_of ugv8Store ugv1)
	(ground_path area20 area18)
	(ground_path area43 area44)
	(ground_path area48 area47)
	(ground_path area43 area41)
	(ground_path area58 area55)
	(ground_path area11 area9)
	(ground_path area24 area30)
	(water_path area17 area38)
	(store_of ugv11Store ugv1)
	(ground_path area16 area17)
	(water_path area42 area41)
)
(:goal
	(and
		(communicated_data disaster1)
		(communicated_data disaster2)
		(communicated_data disaster3)
		(communicated_data disaster4)
		(communicated_data disaster5)
		(communicated_data disaster6)
		(communicated_data disaster7)
		(communicated_data disaster8)
		(communicated_data disaster9)
		(communicated_data disaster10)
		(communicated_data disaster11)
		(communicated_data disaster12)
		(communicated_data disaster13)
		(communicated_data disaster14)
		(communicated_data disaster15)
		(communicated_data disaster16)
		(box_at_area box1 area29)
		(box_at_area box2 area33)
		(box_at_area box3 area39)
		(box_at_area box4 area54)
		(box_at_area box5 area6)
		(box_at_area box6 area31)
		(box_at_area box7 area7)
		(box_at_area box8 area21)
		(box_at_area box9 area15)
		(box_at_area box10 area18)
		(have_water_sample_cdm cdm2 area35)
		(have_water_sample_cdm cdm1 area40)
		(have_water_sample_cdm cdm3 area2)
		(have_water_sample_cdm cdm3 area17)
		(have_water_sample_cdm cdm4 area8)
		(have_water_sample_cdm cdm5 area28)
		(have_water_sample_cdm cdm6 area4)
		(have_water_sample_cdm cdm6 area56)
		(have_water_sample_cdm cdm5 area33)
		(have_water_sample_cdm cdm1 area37)
	)
)
)

; plan
1. (pickup_box ugv1 ugv2store cdm1 area1 box1)
   deleted: (empty ugv2store) (box_at_cdm box1 cdm1)
   added: (full ugv2store) (box_at box1 ugv1)
   goals met: 0 of 36
2. (pickup_box ugv1 ugv3store cdm1 area1 box3)
   deleted: (empty ugv3store) (box_at_cdm box3 cdm1)
   added: (full ugv3store) (box_at box3 ugv1)
   goals met: 0 of 36
3. (take_picture ugv1 area13 disaster5)
   added: (have_picture ugv1 disaster5)
   goals met: 0 of 36
4. (pickup_box ugv1 ugv11store cdm2 area13 box2)
   deleted: (empty ugv11store) (box_at_cdm box2 cdm2)
   added: (full ugv11store) (box_at box2 ugv1)
   goals met: 0 of 36
5. (pickup_box ugv1 ugv12store cdm3 area21 box5)
   deleted: (empty ugv12store) (box_at_cdm box5 cdm3)
   added: (full ugv12store) (box_at box5 ugv1)
   goals met: 0 of 36
6. (communicate_data ugv1 cdm3 disaster5 area21 area21)
   deleted: (have_picture ugv1 disaster5)
   added: (communicated_data disaster5)
   goals met: 1 of 36
7. (drop_box ugv1 ugv10store area33 box2)
   deleted: (box_at box2 ugv1)
   added: (box_at_area box2 area33)
   goals met: 2 of 36
8. (pickup_box ugv1 ugv4store cdm4 area33 box4)
   deleted: (empty ugv4store) (box_at_cdm box4 cdm4)
   added: (full ugv4store) (box_at box4 ugv1)
   goals met: 2 of 36
9. (pickup_box ugv1 ugv5store cdm4 area33 box6)
   deleted: (empty ugv5store) (box_at_cdm box6 cdm4)
   added: (full ugv5store) (box_at box6 ugv1)
   goals met: 2 of 36
10. (sample_water ugv1 ugv1store area33)
   deleted: (empty ugv1store)
   added: (full ugv1store) (have_water_sample ugv1 area33)
   goals met: 2 of 36
11. (take_picture ugv1 area41 disaster9)
   added: (have_picture ugv1 disaster9)
   goals met: 2 of 36
12. (communicate_data ugv1 cdm3 disaster9 area21 area21)
   deleted: (have_picture ugv1 disaster9)
   added: (communicated_data disaster9)
   goals met: 3 of 36
13. (pickup_box ugv1 ugv6store cdm5 area41 box7)
   deleted: (empty ugv6store) (box_at_cdm box7 cdm5)
   added: (full ugv6store) (box_at box7 ugv1)
   goals met: 3 of 36
14. (pickup_box ugv1 ugv7store cdm5 area41 box8)
   deleted: (empty ugv7store) (box_at_cdm box8 cdm5)
   added: (full ugv7store) (box_at box8 ugv1)
   goals met: 3 of 36
15. (drop_box ugv1 ugv10store area21 box8)
   deleted: (box_at box8 ugv1)
   added: (box_at_area box8 area21)
   goals met: 4 of 36
16. (drop_sample ugv1 ugv10store area41 area33 cdm5)
   deleted: (have_water_sample ugv1 area33)
   added: (have_water_sample_cdm cdm5 area33)
   goals met: 5 of 36
17. (navigate_uav ugv1 area41 area28)
   deleted: (at ugv1 area41)
   added: (at ugv1 area28)
   goals met: 5 of 36
18. (take_picture ugv1 area28 disaster16)
   added: (have_picture ugv1 disaster16)
   goals met: 5 of 36
19. (communicate_data ugv1 cdm3 disaster16 area21 area21)
   deleted: (have_picture ugv1 disaster16)
   added: (communicated_data disaster16)
   goals met: 6 of 36
20. (navigate_uav ugv1 area28 area37)
   deleted: (at ugv1 area28)
   added: (at ugv1 area37)
   goals met: 6 of 36
21. (take_picture ugv1 area37 disaster10)
   added: (have_picture ugv1 disaster10)
   goals met: 6 of 36
22. (communicate_data ugv1 cdm3 disaster10 area21 area21)
   deleted: (have_picture ugv1 disaster10)
   added: (communicated_data disaster10)
   goals met: 7 of 36
23. (sample_water ugv1 ugv8store area37)
   deleted: (empty ugv8store)
   added: (full ugv8store) (have_water_sample ugv1 area37)
   goals met: 7 of 36
24. (drop_sample ugv1 ugv10store area1 area37 cdm1)
   deleted: (have_water_sample ugv1 area37)
   added: (have_water_sample_cdm cdm1 area37)
   goals met: 8 of 36
25. (navigate_uav ugv1 area37 area11)
   deleted: (at ugv1 area37)
   added: (at ugv1 area11)
   goals met: 8 of 36
26. (take_picture ugv1 area11 disaster8)
   added: (have_picture ugv1 disaster8)
   goals met: 8 of 36
27. (navigate_uav ugv1 area11 area36)
   deleted: (at ugv1 area11)
   added: (at ugv1 area36)
   goals met: 8 of 36
28. (communicate_data ugv1 cdm3 disaster8 area21 area21)
   deleted: (have_picture ugv1 disaster8)
   added: (communicated_data disaster8)
   goals met: 9 of 36
29. (take_picture ugv1 area36 disaster4)
   added: (have_picture ugv1 disaster4)
   goals met: 9 of 36
30. (communicate_data ugv1 cdm3 disaster4 area21 area21)
   deleted: (have_picture ugv1 disaster4)
   added: (communicated_data disaster4)
   goals met: 10 of 36
31. (navigate_uav ugv1 area36 area39)
   deleted: (at ugv1 area36)
   added: (at ugv1 area39)
   goals met: 10 of 36
32. (drop_box ugv1 ugv10store area39 box3)
   deleted: (box_at box3 ugv1)
   added: (box_at_area box3 area39)
   goals met: 11 of 36
33. (navigate_uav ugv1 area39 area24)
   deleted: (at ugv1 area39)
   added: (at ugv1 area24)
   goals met: 11 of 36
34. (take_picture ugv1 area24 disaster11)
   added: (have_picture ugv1 disaster11)
   goals met: 11 of 36
35. (communicate_data ugv1 cdm3 disaster11 area21 area21)
   deleted: (have_picture ugv1 disaster11)
   added: (communicated_data disaster11)
   goals met: 12 of 36
36. (pickup_box ugv1 ugv9store cdm6 area53 box10)
   deleted: (empty ugv9store) (box_at_cdm box10 cdm6)
   added: (full ugv9store) (box_at box10 ugv1)
   goals met: 12 of 36
37. (pickup_box ugv1 ugv10store cdm6 area53 box9)
   deleted: (empty ugv10store) (box_at_cdm box9 cdm6)
   added: (full ugv10store) (box_at box9 ugv1)
   goals met: 12 of 36
38. (navigate_uav ugv1 area1 area18)
   deleted: (at ugv1 area1)
   added: (at ugv1 area18)
   goals met: 12 of 36
39. (drop_box ugv1 ugv10store area18 box10)
   deleted: (full ugv10store) (box_at box10 ugv1)
   added: (empty ugv10store) (box_at_area box10 area18)
   goals met: 13 of 36
40. (navigate_uav ugv1 area18 area4)
   deleted: (at ugv1 area18)
   added: (at ugv1 area4)
   goals met: 13 of 36
41. (sample_water ugv1 usv11store area4)
   deleted: (empty usv11store)
   added: (full usv11store) (have_water_sample ugv1 area4)
   goals met: 13 of 36
42. (navigate_uav ugv1 area4 area44)
   deleted: (at ugv1 area4)
   added: (at ugv1 area44)
   goals met: 13 of 36
43. (take_picture ugv1 area44 disaster13)
   added: (have_picture ugv1 disaster13)
   goals met: 13 of 36
44. (communicate_data ugv1 cdm3 disaster13 area21 area21)
   deleted: (have_picture ugv1 disaster13)
   added: (communicated_data disaster13)
   goals met: 14 of 36
45. (navigate_uav ugv1 area44 area1)
   deleted: (at ugv1 area44)
   added: (at ugv1 area1)
   goals met: 14 of 36
46. (drop_sample ugv1 ugv10store area53 area4 cdm6)
   deleted: (have_water_sample ugv1 area4)
   added: (have_water_sample_cdm cdm6 area4)
   goals met: 15 of 36
47. (navigate_uav ugv1 area53 area7)
   deleted: (at ugv1 area53)
   added: (at ugv1 area7)
   goals met: 15 of 36
48. (take_picture ugv1 area7 disaster6)
   added: (have_picture ugv1 disaster6)
   goals met: 15 of 36
49. (communicate_data ugv1 cdm3 disaster6 area21 area21)
   deleted: (have_picture ugv1 disaster6)
   added: (communicated_data disaster6)
   goals met: 16 of 36
50. (drop_box ugv1 ugv10store area7 box7)
   deleted: (box_at box7 ugv1)
   added: (box_at_area box7 area7)
   goals met: 17 of 36
51. (navigate_uav ugv1 area7 area15)
   deleted: (at ugv1 area7)
   added: (at ugv1 area15)
   goals met: 17 of 36
52. (drop_box ugv1 ugv10store area15 box9)
   deleted: (box_at box9 ugv1)
   added: (box_at_area box9 area15)
   goals met: 18 of 36
53. (navigate_uav ugv1 area15 area8)
   deleted: (at ugv1 area15)
   added: (at ugv1 area8)
   goals met: 18 of 36
54. (navigate_uav ugv1 area24 area17)
   deleted: (at ugv1 area24)
   added: (at ugv1 area17)
   goals met: 18 of 36
55. (sample_water ugv1 usv1store area17)
   deleted: (empty usv1store)
   added: (full usv1store) (have_water_sample ugv1 area17)
   goals met: 18 of 36
56. (drop_sample ugv1 ugv10store area21 area17 cdm3)
   deleted: (have_water_sample ugv1 area17)
   added: (have_water_sample_cdm cdm3 area17)
   goals met: 19 of 36
57. (sample_water ugv1 usv2store area8)
   deleted: (empty usv2store)
   added: (full usv2store) (have_water_sample ugv1 area8)
   goals met: 19 of 36
58. (drop_sample ugv1 ugv10store area33 area8 cdm4)
   deleted: (have_water_sample ugv1 area8)
   added: (have_water_sample_cdm cdm4 area8)
   goals met: 20 of 36
59. (navigate_uav ugv1 area8 area2)
   deleted: (at ugv1 area8)
   added: (at ugv1 area2)
   goals met: 20 of 36
60. (navigate_uav ugv1 area17 area56)
   deleted: (at ugv1 area17)
   added: (at ugv1 area56)
   goals met: 20 of 36
61. (sample_water ugv1 usv3store area2)
   deleted: (empty usv3store)
   added: (full usv3store) (have_water_sample ugv1 area2)
   goals met: 20 of 36
62. (navigate_uav ugv1 area2 area58)
   deleted: (at ugv1 area2)
   added: (at ugv1 area58)
   goals met: 20 of 36
63. (drop_sample ugv1 ugv10store area21 area2 cdm3)
   deleted: (have_water_sample ugv1 area2)
   added: (have_water_sample_cdm cdm3 area2)
   goals met: 21 of 36
64. (navigate_uav ugv1 area21 area29)
   deleted: (at ugv1 area21)
   added: (at ugv1 area29)
   goals met: 21 of 36
65. (drop_box ugv1 ugv10store area29 box1)
   deleted: (box_at box1 ugv1)
   added: (box_at_area box1 area29)
   goals met: 22 of 36
66. (sample_water ugv1 usv12store area56)
   deleted: (empty usv12store)
   added: (full usv12store) (have_water_sample ugv1 area56)
   goals met: 22 of 36
67. (take_picture ugv1 area58 disaster1)
   added: (have_picture ugv1 disaster1)
   goals met: 22 of 36
68. (communicate_data ugv1 cdm1 disaster1 area1 area1)
   deleted: (have_picture ugv1 disaster1)
   added: (communicated_data disaster1)
   goals met: 23 of 36
69. (navigate_uav ugv1 area58 area20)
   deleted: (at ugv1 area58)
   added: (at ugv1 area20)
   goals met: 23 of 36
70. (take_picture ugv1 area20 disaster15)
   added: (have_picture ugv1 disaster15)
   goals met: 23 of 36
71. (communicate_data ugv1 cdm1 disaster15 area1 area1)
   deleted: (have_picture ugv1 disaster15)
   added: (communicated_data disaster15)
   goals met: 24 of 36
72. (navigate_uav ugv1 area56 area27)
   deleted: (at ugv1 area56)
   added: (at ugv1 area27)
   goals met: 24 of 36
73. (take_picture ugv1 area27 disaster2)
   added: (have_picture ugv1 disaster2)
   goals met: 24 of 36
74. (communicate_data ugv1 cdm1 disaster2 area1 area1)
   deleted: (have_picture ugv1 disaster2)
   added: (communicated_data disaster2)
   goals met: 25 of 36
75. (navigate_uav ugv1 area27 area28)
   deleted: (at ugv1 area27)
   added: (at ugv1 area28)
   goals met: 25 of 36
76. (sample_water ugv1 usv4store area28)
   deleted: (empty usv4store)
   added: (full usv4store) (have_water_sample ugv1 area28)
   goals met: 25 of 36
77. (navigate_uav ugv1 area28 area30)
   deleted: (at ugv1 area28)
   added: (at ugv1 area30)
   goals met: 25 of 36
78. (take_picture ugv1 area30 disaster12)
   added: (have_picture ugv1 disaster12)
   goals met: 25 of 36
79. (communicate_data ugv1 cdm1 disaster12 area1 area1)
   deleted: (have_picture ugv1 disaster12)
   added: (communicated_data disaster12)
   goals met: 26 of 36
80. (navigate_uav ugv1 area33 area31)
   deleted: (at ugv1 area33)
   added: (at ugv1 area31)
   goals met: 26 of 36
81. (navigate_uav ugv1 area30 area35)
   deleted: (at ugv1 area30)
   added: (at ugv1 area35)
   goals met: 26 of 36
82. (drop_box ugv1 ugv10store area31 box6)
   deleted: (box_at box6 ugv1)
   added: (box_at_area box6 area31)
   goals met: 27 of 36
83. (sample_water ugv1 usv5store area35)
   deleted: (empty usv5store)
   added: (full usv5store) (have_water_sample ugv1 area35)
   goals met: 27 of 36
84. (drop_sample ugv1 ugv10store area13 area35 cdm2)
   deleted: (have_water_sample ugv1 area35)
   added: (have_water_sample_cdm cdm2 area35)
   goals met: 28 of 36
85. (navigate_uav ugv1 area13 area38)
   deleted: (at ugv1 area13)
   added: (at ugv1 area38)
   goals met: 28 of 36
86. (take_picture ugv1 area38 disaster14)
   added: (have_picture ugv1 disaster14)
   goals met: 28 of 36
87. (communicate_data ugv1 cdm1 disaster14 area1 area1)
   deleted: (have_picture ugv1 disaster14)
   added: (communicated_data disaster14)
   goals met: 29 of 36
88. (navigate_uav ugv1 area38 area40)
   deleted: (at ugv1 area38)
   added: (at ugv1 area40)
   goals met: 29 of 36
89. (navigate_uav ugv1 area35 area41)
   deleted: (at ugv1 area35)
   added: (at ugv1 area41)
   goals met: 29 of 36
90. (sample_water ugv1 usv6store area40)
   deleted: (empty usv6store)
   added: (full usv6store) (have_water_sample ugv1 area40)
   goals met: 29 of 36
91. (drop_sample ugv1 ugv10store area1 area40 cdm1)
   deleted: (have_water_sample ugv1 area40)
   added: (have_water_sample_cdm cdm1 area40)
   goals met: 30 of 36
92. (navigate_uav ugv1 area1 area49)
   deleted: (at ugv1 area1)
   added: (at ugv1 area49)
   goals met: 30 of 36
93. (navigate_uav ugv1 area40 area54)
   deleted: (at ugv1 area40)
   added: (at ugv1 area54)
   goals met: 30 of 36
94. (drop_sample ugv1 ugv10store area41 area28 cdm5)
   deleted: (have_water_sample ugv1 area28)
   added: (have_water_sample_cdm cdm5 area28)
   goals met: 31 of 36
95. (navigate_uav ugv1 area41 area55)
   deleted: (at ugv1 area41)
   added: (at ugv1 area55)
   goals met: 31 of 36
96. (take_picture ugv1 area49 disaster3)
   added: (have_picture ugv1 disaster3)
   goals met: 31 of 36
97. (navigate_uav ugv1 area49 area53)
   deleted: (at ugv1 area49)
   added: (at ugv1 area53)
   goals met: 31 of 36
98. (communicate_data ugv1 cdm6 disaster3 area53 area53)
   deleted: (have_picture ugv1 disaster3)
   added: (communicated_data disaster3)
   goals met: 32 of 36
99. (drop_sample ugv1 ugv10store area53 area56 cdm6)
   deleted: (have_water_sample ugv1 area56)
   added: (have_water_sample_cdm cdm6 area56)
   goals met: 33 of 36
100. (navigate_uav ugv1 area53 area6)
   deleted: (at ugv1 area53)
   added: (at ugv1 area6)
   goals met: 33 of 36
101. (drop_box ugv1 ugv10store area54 box4)
   deleted: (box_at box4 ugv1)
   added: (box_at_area box4 area54)
   goals met: 34 of 36
102. (take_picture ugv1 area55 disaster7)
   added: (have_picture ugv1 disaster7)
   goals met: 34 of 36
103. (communicate_data ugv1 cdm4 disaster7 area29 area33)
   deleted: (have_picture ugv1 disaster7)
   added: (communicated_data disaster7)
   goals met: 35 of 36
104. (drop_box ugv1 ugv10store area6 box5)
   deleted: (box_at box5 ugv1)
   added: (box_at_area box5 area6)
   goals met: 36 of 36
